In [1]:
import pandas as pd
import numpy as np

In [2]:
 df = pd.DataFrame({'From_To':
                           ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 'Budapest_PaRis', 'Brussels_londOn'],
                       'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                       'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                       'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', '12. Air France',
                                   '"Swiss Air"']
                       })

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

 ## 1. Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).

In [4]:
locatns = df[df["FlightNumber"].isnull() == True].index


for locatn in locatns:
    fill_value = df["FlightNumber"].loc[locatn - 1] + 10
    df.loc[locatn, "FlightNumber"] = fill_value

In [5]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [6]:
df["FlightNumber"] = df["FlightNumber"].astype("int64")

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   From_To       5 non-null      object
 1   FlightNumber  5 non-null      int64
 2   RecentDelays  5 non-null      object
 3   Airline       5 non-null      object
dtypes: int64(1), object(3)
memory usage: 288.0+ bytes

## 2. The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [8]:
from_and_to = pd.DataFrame( data=tuple(df["From_To"].apply(lambda x : x.split("_"))), columns=["From", "To"] ) 
from_and_to

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

## 3. Notice how the capitalisation of the city names is all mixed up in this  temporary DataFrame. 'Standardise the strings so that only the first letter is  uppercase (e.g. "londON" should become "London".)

In [9]:
from_and_to["From"] = from_and_to["From"].apply(lambda x: x.title())
from_and_to["To"] = from_and_to["To"].apply(lambda x: x.title())

In [10]:
from_and_to

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

## 5. In the RecentDelays column, the values have been entered into the  DataFrame as a list. We would like each first value in its own column, each  second value in its own column, and so on. If there isn't an Nth value, the value  should be NaN.  Expand the Series of lists into a DataFrame named delays, rename the columns  delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df  with delays.

In [11]:

df.drop(labels=["From_To"], axis=1)
df = pd.concat([from_and_to, df], axis=1)

In [12]:
df

,From,To,From_To,FlightNumber,RecentDelays,Airline
0,London,Paris,LoNDon_paris,10045,"[23, 47]",KLM(!)
1,Madrid,Milan,MAdrid_miLAN,10055,[],<Air France> (12)
2,London,Stockholm,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. )
3,Budapest,Paris,Budapest_PaRis,10075,[13],12. Air France
4,Brussels,London,Brussels_londOn,10085,"[67, 32]","""Swiss Air"""

In [31]:
delay_1 = []
delay_2 = []

for row in df["RecentDelays"]:
    element_1 = np.nan
    element_2 = np.nan
    
    try:
        element_1 = row[0]  
    except IndexError as e:
        pass
    
    try:
        element_2 = row[1]
    except IndexError as e:
        pass
    
    delay_1.append(element_1)
    delay_2.append(element_2)
    
    
delay_1 = pd.Series(delay_1)
delay_2 = pd.Series(delay_2)

print(delay_1)
print(delay_2)

0    23.0
1     NaN
2    24.0
3    13.0
4    67.0
dtype: float64
0    47.0
1     NaN
2    43.0
3     NaN
4    32.0
dtype: float64

In [33]:
df["delay_1"] = delay_1
df["delay_2"] = delay_2

In [34]:
df

,From,To,From_To,FlightNumber,RecentDelays,Airline,delay_1,delay_2
0,London,Paris,LoNDon_paris,10045,"[23, 47]",KLM(!),23.0,47.0
1,Madrid,Milan,MAdrid_miLAN,10055,[],<Air France> (12),NaN,NaN
2,London,Stockholm,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),24.0,43.0
3,Budapest,Paris,Budapest_PaRis,10075,[13],12. Air France,13.0,NaN
4,Brussels,London,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",67.0,32.0